{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsHealthMonitoringConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration",
    "id":  "0442ebae-1d6e-4948-8456-78a74085d304",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-20T17:30:23.3878971Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2022-09-20T17:30:23.3878971Z",
    "description":  "",
    "displayName":  "Baseline - Win - Health Monitoring - Endpoint Analytics \u0026 Windows Updates",
    "version":  1,
    "allowDeviceHealthMonitoring@odata.type":  "#microsoft.graph.enablement",
    "allowDeviceHealthMonitoring":  "enabled",
    "configDeviceHealthMonitoringScope@odata.type":  "#microsoft.graph.windowsHealthMonitoringScope",
    "configDeviceHealthMonitoringScope":  "bootPerformance,windowsUpdates",
    "configDeviceHealthMonitoringCustomScope":  null,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceConfigurationAssignment",
                            "@odata.id":  "deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/assignments(\u00270442ebae-1d6e-4948-8456-78a74085d304_adadadad-808e-44e2-905a-0b7873a8a531\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/assignments(\u00270442ebae-1d6e-4948-8456-78a74085d304_adadadad-808e-44e2-905a-0b7873a8a531\u0027)",
                            "id":  "0442ebae-1d6e-4948-8456-78a74085d304_adadadad-808e-44e2-905a-0b7873a8a531",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  "0442ebae-1d6e-4948-8456-78a74085d304",
                            "intent@odata.type":  "#microsoft.graph.deviceConfigAssignmentIntent",
                            "intent":  "apply",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.allDevicesAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none"
                                       }
                        }
                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00270442ebae-1d6e-4948-8456-78a74085d304\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
