{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id":  "2e998a4e-dbd6-48fe-81d5-a39fffd1adb3",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-05T20:03:20.7089317Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2022-09-05T20:03:20.7089317Z",
    "description":  "Devices in this ring receive updates 3 days after release and have a 2-day deadline on install.",
    "displayName":  "WUfB - Ring 2 - UAT",
    "version":  1,
    "deliveryOptimizationMode@odata.type":  "#microsoft.graph.windowsDeliveryOptimizationMode",
    "deliveryOptimizationMode":  "userDefined",
    "prereleaseFeatures@odata.type":  "#microsoft.graph.prereleaseFeatures",
    "prereleaseFeatures":  "userDefined",
    "automaticUpdateMode@odata.type":  "#microsoft.graph.automaticUpdateMode",
    "automaticUpdateMode":  "windowsDefault",
    "microsoftUpdateServiceAllowed":  true,
    "driversExcluded":  false,
    "installationSchedule":  null,
    "qualityUpdatesDeferralPeriodInDays":  3,
    "featureUpdatesDeferralPeriodInDays":  0,
    "qualityUpdatesPaused":  false,
    "featureUpdatesPaused":  false,
    "qualityUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly@odata.type":  "#microsoft.graph.windowsUpdateType",
    "businessReadyUpdatesOnly":  "userDefined",
    "skipChecksBeforeRestart":  false,
    "updateWeeks":  null,
    "qualityUpdatesPauseStartDate":  null,
    "featureUpdatesPauseStartDate":  null,
    "featureUpdatesRollbackWindowInDays":  30,
    "qualityUpdatesWillBeRolledBack":  false,
    "featureUpdatesWillBeRolledBack":  false,
    "qualityUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays":  null,
    "engagedRestartSnoozeScheduleInDays":  null,
    "engagedRestartTransitionScheduleInDays":  null,
    "deadlineForFeatureUpdatesInDays":  2,
    "deadlineForQualityUpdatesInDays":  2,
    "deadlineGracePeriodInDays":  1,
    "postponeRebootUntilAfterDeadline":  true,
    "autoRestartNotificationDismissal@odata.type":  "#microsoft.graph.autoRestartNotificationDismissalMethod",
    "autoRestartNotificationDismissal":  "notConfigured",
    "scheduleRestartWarningInHours":  null,
    "scheduleImminentRestartWarningInMinutes":  null,
    "userPauseAccess@odata.type":  "#microsoft.graph.enablement",
    "userPauseAccess":  "disabled",
    "userWindowsUpdateScanAccess@odata.type":  "#microsoft.graph.enablement",
    "userWindowsUpdateScanAccess":  "enabled",
    "updateNotificationLevel@odata.type":  "#microsoft.graph.windowsUpdateNotificationDisplayOption",
    "updateNotificationLevel":  "notConfigured",
    "allowWindows11Upgrade":  false,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceConfigurationAssignment",
                            "@odata.id":  "deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/assignments(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3_147f46c9-9194-484f-9cfc-aae0781ae94c\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/assignments(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3_147f46c9-9194-484f-9cfc-aae0781ae94c\u0027)",
                            "id":  "2e998a4e-dbd6-48fe-81d5-a39fffd1adb3_147f46c9-9194-484f-9cfc-aae0781ae94c",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  "2e998a4e-dbd6-48fe-81d5-a39fffd1adb3",
                            "intent@odata.type":  "#microsoft.graph.deviceConfigAssignmentIntent",
                            "intent":  "apply",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "147f46c9-9194-484f-9cfc-aae0781ae94c"
                                       }
                        }
                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview",
    "deviceUpdateStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceUpdateStates/$ref",
    "deviceUpdateStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceUpdateStates",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.extendFeatureUpdatesPause":  {
                                                       "title":  "microsoft.graph.extendFeatureUpdatesPause",
                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendFeatureUpdatesPause"
                                                   },
    "#microsoft.graph.extendQualityUpdatesPause":  {
                                                       "title":  "microsoft.graph.extendQualityUpdatesPause",
                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendQualityUpdatesPause"
                                                   },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00272e998a4e-dbd6-48fe-81d5-a39fffd1adb3\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
