{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2024-08-27T14:33:06.4056266Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2024-08-29T12:13:58.8294917Z",
  "name": "MacOS - OIB - Disk Encryption - D - FileVault - v1.1",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 3,
  "technologies": "mdm,appleRemoteManagement",
  "id": "3828f80f-4e13-471d-bfda-52446dc1379c",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.mcx.filevault2_enable",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.mcx.filevault2_enable_0",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.mcx.filevault2_forceenableinsetupassistant",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.mcx.filevault2_forceenableinsetupassistant_true",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_6",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.mcx_dontallowfdedisable",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.mcx_dontallowfdedisable_true",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.security.fderecoverykeyescrow_location",
                "settingInstanceTemplateReference": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "You can retrieve the personal recovery key for your macOS device from the Microsoft Intune app, Company Portal website, or Company Portal apps for Android and iOS/iPadOS. Support cannot access recovery keys that belong to personal devices."
                }
              }
            ]
          }
        ]
      }
    }
  ]
}
