{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-12-01T13:29:31.3497883Z","creationSource":null,"description":"RSRs are designed to deliver security improvements, such as those for the Safari web browser and critical system libraries, faster than traditional software updates.","lastModifiedDateTime":"2025-12-03T15:33:04.217758Z","name":"MacOS - OIB - Updates - D - DDM Rapid Security Response Update - v1.0","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"807d32f1-8f8c-4b27-a666-5e4a11f1b757","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"softwareupdate_softwareupdate","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"softwareupdate_rapidsecurityresponse","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_rapidsecurityresponse_enable","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_rapidsecurityresponse_enable_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_rapidsecurityresponse_enablerollback","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_rapidsecurityresponse_enablerollback_true","children":[]}}]}]}]}]}}]}