{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-12-01T13:37:36.4387981Z","creationSource":null,"description":"WARNING : Enable \"Automatic updates settings\" only if you dont use \"Targeted\" or \"Latest\" OS updates policies. Recommended to use \"Deferrals policy\" if enabling Automatic updates settings for more granularity.\n\nSetup the base settings for updating the mac, like enabling users to update, or download and update the mac.","lastModifiedDateTime":"2025-12-03T15:33:59.5512341Z","name":"MacOS - OIB - Updates - D - DDM Update settings v1.0","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"0ffdc0b3-4ed6-477f-958a-3d128d251131","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"softwareupdate_softwareupdate","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_allowstandarduserosupdates","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_allowstandarduserosupdates_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"softwareupdate_automaticactions","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_automaticactions_download","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_automaticactions_download_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_automaticactions_installosupdates","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_automaticactions_installosupdates_2","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_automaticactions_installsecurityupdate","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_automaticactions_installsecurityupdate_1","children":[]}}]}]},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"softwareupdate_notifications","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"softwareupdate_notifications_true","children":[]}}]}]}}]}