{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-12-01T13:31:42.5448799Z","creationSource":null,"description":"WARNING : Do not enable the \"Latest OS Update Policy\" alongside this policy.\n\nEnforce a specific OS version to be attained at a certain date.\nThis policy is best suited for environments with strict app compatibility requirements, phased deployment strategies, or formal change management workflows.","lastModifiedDateTime":"2025-12-03T15:34:36.9561644Z","name":"MacOS - OIB - Updates - D - DDM Targeted OS Update Policy - v1.0","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"5c76d64e-1360-405c-949e-c5d18164cde8","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"enforcement_enforcement","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"enforcement_targetlocaldatetime","settingInstanceTemplateReference":null,"auditRuleInformation":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"2026-01-01T06:30:00"}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"enforcement_targetosversion","settingInstanceTemplateReference":null,"auditRuleInformation":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"15.7.1"}}]}]}}]}