{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-12-01T13:27:03.6709514Z","creationSource":null,"description":"WARNING : Do not enable the \"Targeted OS Update Policy\" alongside this policy.\n\nEnforce latest supported OS version automatically.\nThis policy is ideal for organizations that prioritize rapid patching, regulatory compliance, and minimal IT overhead.","lastModifiedDateTime":"2025-12-03T15:32:31.6547218Z","name":"MacOS - OIB - Updates - D - DDM Latest OS Update Policy - v1.0","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"9847eb07-1195-4c05-803b-ce5106443262","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"ddm-latestsoftwareupdate_ddm-latestsoftwareupdate","settingInstanceTemplateReference":null,"auditRuleInformation":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"ddm-latestsoftwareupdate_delayindays","settingInstanceTemplateReference":null,"auditRuleInformation":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":30}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"ddm-latestsoftwareupdate_installtime","settingInstanceTemplateReference":null,"auditRuleInformation":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"12:00"}}]}}]}]}}]}