{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-08-09T15:01:32.9198892Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-12-05T20:09:49.8021979Z",
    "name":  "Win - OIB - SC - Google Chrome - U - Profiles, Sign-In and Sync - v3.0 (Deprecated)",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  8,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "d0cb201d-9bc3-4820-a4e2-830cf1ebb268",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_browsersignin",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_browsersignin_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_syncdisabled",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_syncdisabled_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browseraddpersonenabled",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browseraddpersonenabled_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserguestmodeenabled",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserguestmodeenabled_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_roamingprofilesupportenabled",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_roamingprofilesupportenabled_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00275\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00275\u0027)",
                         "id":  "5",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forceephemeralprofiles",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forceephemeralprofiles_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00275\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00276\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00276\u0027)",
                         "id":  "6",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_profilepickeronstartupavailability",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_profilepickeronstartupavailability_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00276\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00276\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00277\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00277\u0027)",
                         "id":  "7",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_restrictsignintopattern",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_restrictsignintopattern_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00277\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/settings(\u00277\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027d0cb201d-9bc3-4820-a4e2-830cf1ebb268\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
