{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-10-20T19:56:16.4175283Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-04-24T11:50:04.0241007Z",
    "name":  "Win - OIB - SC - Device Security - D - Security Hardening - v3.6",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  81,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "99ff7a9a-e27e-4217-8325-dfebd2e9cfe0",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver_4",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00275\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00275\u0027)",
                         "id":  "5",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6_2",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00275\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00276\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00276\u0027)",
                         "id":  "6",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting_2",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00276\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00276\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00277\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00277\u0027)",
                         "id":  "7",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00277\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00277\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00278\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00278\u0027)",
                         "id":  "8",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00278\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00278\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00279\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00279\u0027)",
                         "id":  "9",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod_screensavergraceperiod",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  0
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00279\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u00279\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002710\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002710\u0027)",
                         "id":  "10",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002710\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002710\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002711\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002711\u0027)",
                         "id":  "11",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002711\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002711\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002712\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002712\u0027)",
                         "id":  "12",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_3",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002712\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002712\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002713\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002713\u0027)",
                         "id":  "13",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002713\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002713\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002714\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002714\u0027)",
                         "id":  "14",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_printing2_registerspoolerremoterpcendpoint",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_printing2_registerspoolerremoterpcendpoint_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002714\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002714\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002715\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002715\u0027)",
                         "id":  "15",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002715\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002715\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002716\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002716\u0027)",
                         "id":  "16",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_edit",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  ""
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedforest_chk",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedforest_chk_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_chk",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_chk_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationoninstall_enum",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationoninstall_enum_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationonupdate_enum",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationonupdate_enum_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002716\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002716\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002717\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002717\u0027)",
                         "id":  "17",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002717\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002717\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002718\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002718\u0027)",
                         "id":  "18",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002718\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002718\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002719\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002719\u0027)",
                         "id":  "19",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_bootstartdriverinitialization",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_system_bootstartdriverinitialization_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_bootstartdriverinitialization_selectdriverloadpolicy",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_system_bootstartdriverinitialization_selectdriverloadpolicy_3",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002719\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002719\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002720\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002720\u0027)",
                         "id":  "20",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_disabledownloadingofprintdriversoverhttp",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_connectivity_disabledownloadingofprintdriversoverhttp_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002720\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002720\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002721\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002721\u0027)",
                         "id":  "21",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_disableinternetdownloadforwebpublishingandonlineorderingwizards",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_connectivity_disableinternetdownloadforwebpublishingandonlineorderingwizards_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002721\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002721\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002722\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002722\u0027)",
                         "id":  "22",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remoteassistance_unsolicitedremoteassistance",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remoteassistance_unsolicitedremoteassistance_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002722\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002722\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002723\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002723\u0027)",
                         "id":  "23",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remoteassistance_solicitedremoteassistance",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remoteassistance_solicitedremoteassistance_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002723\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002723\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002724\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002724\u0027)",
                         "id":  "24",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_autoplay_disallowautoplayfornonvolumedevices",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_autoplay_disallowautoplayfornonvolumedevices_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002724\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002724\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002725\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002725\u0027)",
                         "id":  "25",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_autoplay_setdefaultautorunbehavior",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_autoplay_setdefaultautorunbehavior_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_autoplay_setdefaultautorunbehavior_noautorun_dropdown",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_autoplay_setdefaultautorunbehavior_noautorun_dropdown_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002725\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002725\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002726\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002726\u0027)",
                         "id":  "26",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_autoplay_turnoffautoplay",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_autoplay_turnoffautoplay_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box_255",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002726\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002726\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002727\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002727\u0027)",
                         "id":  "27",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_credentialsui_enumerateadministrators",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_credentialsui_enumerateadministrators_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002727\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002727\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002728\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002728\u0027)",
                         "id":  "28",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_enablesmartscreendropdown",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_enablesmartscreendropdown_block",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002728\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002728\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002729\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002729\u0027)",
                         "id":  "29",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_fileexplorer_turnoffdataexecutionpreventionforexplorer",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_fileexplorer_turnoffdataexecutionpreventionforexplorer_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002729\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002729\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002730\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002730\u0027)",
                         "id":  "30",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_fileexplorer_turnoffheapterminationoncorruption",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_fileexplorer_turnoffheapterminationoncorruption_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002730\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002730\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002731\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002731\u0027)",
                         "id":  "31",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_sharing_disablehomegroup",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_sharing_disablehomegroup_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002731\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002731\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002732\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002732\u0027)",
                         "id":  "32",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_pushtoinstall_disablepushtoinstall",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_pushtoinstall_disablepushtoinstall_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002732\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002732\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002733\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002733\u0027)",
                         "id":  "33",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_internetexplorer_disableenclosuredownloading",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_internetexplorer_disableenclosuredownloading_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002733\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002733\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002734\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002734\u0027)",
                         "id":  "34",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_errorreporting_disablewindowserrorreporting",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_errorreporting_disablewindowserrorreporting_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002734\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002734\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002735\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002735\u0027)",
                         "id":  "35",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowspowershell_turnonpowershellscriptblocklogging",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_windowspowershell_turnonpowershellscriptblocklogging_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowspowershell_turnonpowershellscriptblocklogging_enablescriptblockinvocationlogging",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_windowspowershell_turnonpowershellscriptblocklogging_enablescriptblockinvocationlogging_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002735\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002735\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002736\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002736\u0027)",
                         "id":  "36",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_allowbasicauthentication_client",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_allowbasicauthentication_client_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002736\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002736\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002737\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002737\u0027)",
                         "id":  "37",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_allowunencryptedtraffic_client",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_allowunencryptedtraffic_client_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002737\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002737\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002738\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002738\u0027)",
                         "id":  "38",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_disallowdigestauthentication",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_disallowdigestauthentication_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002738\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002738\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002739\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002739\u0027)",
                         "id":  "39",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_allowbasicauthentication_service",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_allowbasicauthentication_service_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002739\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002739\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002740\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002740\u0027)",
                         "id":  "40",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_allowunencryptedtraffic_service",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_allowunencryptedtraffic_service_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002740\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002740\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002741\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002741\u0027)",
                         "id":  "41",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_remotemanagement_disallowstoringofrunascredentials",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_remotemanagement_disallowstoringofrunascredentials_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002741\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002741\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002742\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002742\u0027)",
                         "id":  "42",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_allowphonepclinking",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_connectivity_allowphonepclinking_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002742\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002742\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002743\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002743\u0027)",
                         "id":  "43",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002743\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002743\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002744\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002744\u0027)",
                         "id":  "44",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_experience_allowcortana",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_experience_allowcortana_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002744\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002744\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002745\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002745\u0027)",
                         "id":  "45",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_experience_allowmanualmdmunenrollment",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_experience_allowmanualmdmunenrollment_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002745\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002745\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002746\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002746\u0027)",
                         "id":  "46",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_games_allowadvancedgamingservices",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_games_allowadvancedgamingservices_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002746\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002746\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002747\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002747\u0027)",
                         "id":  "47",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha1",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha1_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha256",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha256_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha384",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha384_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha512",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha512_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002747\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002747\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002748\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002748\u0027)",
                         "id":  "48",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportencryption",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportencryption_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002748\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002748\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002749\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002749\u0027)",
                         "id":  "49",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportsigning",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportsigning_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002749\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002749\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002750\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002750\u0027)",
                         "id":  "50",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_auditinsecureguestlogon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_auditinsecureguestlogon_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002750\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002750\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002751\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002751\u0027)",
                         "id":  "51",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_authratelimiterdelayinms",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  2000
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002751\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002751\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002752\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002752\u0027)",
                         "id":  "52",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_enableauthratelimiter",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_enableauthratelimiter_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002752\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002752\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002753\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002753\u0027)",
                         "id":  "53",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_enablemailslots",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_enablemailslots_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002753\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002753\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002754\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002754\u0027)",
                         "id":  "54",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_maxsmb2dialect",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_maxsmb2dialect_785",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002754\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002754\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002755\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002755\u0027)",
                         "id":  "55",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanserver_minsmb2dialect",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanserver_minsmb2dialect_768",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002755\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002755\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002756\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002756\u0027)",
                         "id":  "56",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_auditinsecureguestlogon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_auditinsecureguestlogon_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002756\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002756\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002757\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002757\u0027)",
                         "id":  "57",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportencryption",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportencryption_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002757\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002757\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002758\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002758\u0027)",
                         "id":  "58",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportsigning",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportsigning_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002758\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002758\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002759\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002759\u0027)",
                         "id":  "59",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002759\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002759\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002760\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002760\u0027)",
                         "id":  "60",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_enablemailslots",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_enablemailslots_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002760\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002760\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002761\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002761\u0027)",
                         "id":  "61",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_maxsmb2dialect",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_maxsmb2dialect_785",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002761\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002761\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002762\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002762\u0027)",
                         "id":  "62",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_minsmb2dialect",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_minsmb2dialect_768",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002762\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002762\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002763\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002763\u0027)",
                         "id":  "63",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_lanmanworkstation_requireencryption",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_lanmanworkstation_requireencryption_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002763\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002763\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002764\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002764\u0027)",
                         "id":  "64",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_privacy_disableprivacyexperience",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_privacy_disableprivacyexperience_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002764\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002764\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002765\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002765\u0027)",
                         "id":  "65",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_security_allowaddprovisioningpackage",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_security_allowaddprovisioningpackage_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002765\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002765\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002766\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002766\u0027)",
                         "id":  "66",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_security_allowremoveprovisioningpackage",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_security_allowremoveprovisioningpackage_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002766\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002766\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002767\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002767\u0027)",
                         "id":  "67",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_security_requireretrievehealthcertificateonboot",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_security_requireretrievehealthcertificateonboot_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002767\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002767\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002768\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002768\u0027)",
                         "id":  "68",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_settings_pagevisibilitylist",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "hide:gaming-gamebar;gaming-gamedvr;gaming-broadcasting;gaming-gamemode;gaming-xboxnetworking"
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002768\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002768\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002769\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002769\u0027)",
                         "id":  "69",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_sudo_enablesudo",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_sudo_enablesudo_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002769\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002769\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002770\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002770\u0027)",
                         "id":  "70",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode_4",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002770\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002770\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002771\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002771\u0027)",
                         "id":  "71",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode_4",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002771\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002771\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002772\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002772\u0027)",
                         "id":  "72",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode_4",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002772\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002772\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002773\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002773\u0027)",
                         "id":  "73",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode_4",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002773\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002773\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002774\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002774\u0027)",
                         "id":  "74",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002774\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002774\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002775\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002775\u0027)",
                         "id":  "75",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002775\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002775\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002776\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002776\u0027)",
                         "id":  "76",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_wifi_allowinternetsharing",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_wifi_allowinternetsharing_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002776\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002776\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002777\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002777\u0027)",
                         "id":  "77",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002777\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002777\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002778\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002778\u0027)",
                         "id":  "78",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002778\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002778\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002779\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002779\u0027)",
                         "id":  "79",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_wirelessdisplay_allowprojectiontopc",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_wirelessdisplay_allowprojectiontopc_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002779\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002779\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002780\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002780\u0027)",
                         "id":  "80",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_wirelessdisplay_requirepinforpairing",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_wirelessdisplay_requirepinforpairing_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002780\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/settings(\u002780\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002799ff7a9a-e27e-4217-8325-dfebd2e9cfe0\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
