{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-08-09T15:01:46.1774311Z",
    "creationSource":  null,
    "description":  "NOTE: Contains policies required for Windows Update for Business Reports. Further configuration required:\nhttps://learn.microsoft.com/en-us/windows/deployment/update/wufb-reports-enable",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-12-05T20:15:27.6408563Z",
    "name":  "Win - OIB - SC - Windows Update for Business - D - Reports and Telemetry - v3.0",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  5,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "8f55652c-7141-4e2d-b398-e6c7d78fdcf4",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_allowdevicenameindiagnosticdata",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_system_allowdevicenameindiagnosticdata_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_allowtelemetry",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_system_allowtelemetry_3",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_update_allowtemporaryenterprisefeaturecontrol",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_update_allowtemporaryenterprisefeaturecontrol_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278f55652c-7141-4e2d-b398-e6c7d78fdcf4\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
