{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-04-10T19:45:21.7705478Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-04-10T19:45:21.7705478Z",
    "name":  "Win - OIB - Defender Antivirus - D - Default Exclusions - v3.1",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  2,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm,microsoftSense",
    "id":  "857edff4-53aa-4ce9-afb2-4dad831a91ad",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "45fea5e9-280d-4da1-9792-fb5736da0ca9_1",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "endpointSecurityAntivirus",
                              "templateDisplayName":  "Microsoft Defender Antivirus exclusions",
                              "templateDisplayVersion":  "Version 1"
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_excludedpaths",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "aaf04adc-c639-464f-b4a7-152e784092e8"
                                                                                      },
                                                 "simpleSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                                                 "simpleSettingCollectionValue":  [
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender Advanced Threat Protection\\"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles(x86)%\\Windows Defender\\"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.chk"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.edb"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.jrs"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.log"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.sdb"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.xml"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.csv"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\Security\\Database\\*.cmtx"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Datastore.edb"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Logs\\edb*.jrs"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Logs\\edb.chk"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Logs\\tmp.edb"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Logs\\res*.log"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\SoftwareDistribution\\Datastore\\Logs\\res*.jrs"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles(x86)%\\Microsoft Intune Management Extension\\Content\\"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\IMECache\\"
                                                                                      }
                                                                                  ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_excludedprocesses",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "96b046ed-f138-4250-9ae0-b0772a93d16f"
                                                                                      },
                                                 "simpleSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                                                 "simpleSettingCollectionValue":  [
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\System32\\ApplicationFrameHost.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\System32\\SearchIndexer.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\System32\\wlanext.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\System32\\Lsalso.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%WinDir%\\System32\\AppVClient.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\MSASCuiL.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\MSASCui.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\MpCmdRun.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\MsMpEng.exe"
                                                                                      },
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "%ProgramFiles%\\Windows Defender\\NisSrv.exe"
                                                                                      }
                                                                                  ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignJustInTimeConfiguration":  {
                                                           "title":  "microsoft.graph.assignJustInTimeConfiguration",
                                                           "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.assignJustInTimeConfiguration"
                                                       },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveJustInTimeConfiguration":  {
                                                             "title":  "microsoft.graph.retrieveJustInTimeConfiguration",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.retrieveJustInTimeConfiguration"
                                                         },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027857edff4-53aa-4ce9-afb2-4dad831a91ad\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
