{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-07-22T13:29:02.6854383Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-12-05T19:36:54.4618886Z",
    "name":  "Win - OIB - ES - Windows Hello for Business - D - WHfB Configuration - v3.2",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  2,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "5e082981-0854-4689-9c49-271e42d11430",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "fcef01f2-439d-4c3f-9184-823fd6e97646_1",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "endpointSecurityAccountProtection",
                              "templateDisplayName":  "Account Protection",
                              "templateDisplayVersion":  "Version 1"
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "0ece2bdc-57c1-4be9-93e9-ac9c395a9c94"
                                                                                      },
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                                       "settingInstanceTemplateId":  "04df0c8b-5d87-494e-865e-6bfeef5a24a5"
                                                                                                                                                   },
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "value":  "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_true",
                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                               "settingValueTemplateId":  "c36f290a-cac2-4a0b-96b8-596a75e4890d",
                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                           },
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                                         "value":  6,
                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                               "settingValueTemplateId":  "b2cec844-c747-466e-ae20-92969da2a10c",
                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                           }
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_false",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_true",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "9a29ce6b-fae8-4785-bbfe-3311f14aa88f"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_true",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "93a7ef59-584d-4177-ac5a-2ca31d47e179",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00275e082981-0854-4689-9c49-271e42d11430\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
