{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')",
  "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2024-11-04T18:54:32.684534Z",
  "creationSource": null,
  "description": "Win - OIB - Google Chrome - D - Security - v3.0",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-11-04T19:43:25.5075186Z",
  "name": "Win - OIB - Google Chrome - D - Security - v3.0",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 56,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm",
  "id": "8908e8f7-4ad6-461d-820e-bccd8dae40b9",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_abusiveexperienceinterventionenforce",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_abusiveexperienceinterventionenforce_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_adssettingforintrusiveadssites",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_adssettingforintrusiveadssites_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_adssettingforintrusiveadssites_adssettingforintrusiveadssites",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_adssettingforintrusiveadssites_adssettingforintrusiveadssites_2",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_allowdinosaureasteregg",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_allowdinosaureasteregg_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_downloadrestrictions",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_downloadrestrictions_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_downloadrestrictions_downloadrestrictions",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_downloadrestrictions_downloadrestrictions_4",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_mediaroutercastallowallips",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_mediaroutercastallowallips_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webrtcallowlegacytlsprotocols",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webrtcallowlegacytlsprotocols_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslerroroverrideallowed",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslerroroverrideallowed_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsernetworktimequeriesenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsernetworktimequeriesenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_remotedebuggingallowed",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_remotedebuggingallowed_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_paymentmethodqueryenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_paymentmethodqueryenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('9')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('10')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('10')",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alwaysopenpdfexternally",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alwaysopenpdfexternally_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('10')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('10')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('11')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('11')",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist_urlblocklistdesc",
              "settingInstanceTemplateReference": null,
              "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
              "simpleSettingCollectionValue": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "chrome://flags"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "chrome://netinternals"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "chrome://tracing"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "file:///d:/"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "file://tsclient/"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "https://amsi.fail"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "https://pastebin.com"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "https://onionshare.org"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "https://send.vis.ee"
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "https://onionmail.org"
                }
              ]
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('11')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('11')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('12')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('12')",
      "id": "12",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_blockthirdpartycookies",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_blockthirdpartycookies_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('12')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('12')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('13')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('13')",
      "id": "13",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('13')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('13')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('14')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('14')",
      "id": "14",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_clearbrowsingdataonexitlist",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_clearbrowsingdataonexitlist_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('14')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('14')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('15')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('15')",
      "id": "15",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_backgroundmodeenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_backgroundmodeenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('15')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('15')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('16')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('16')",
      "id": "16",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_chromevariations",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_chromevariations_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('16')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('16')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('17')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('17')",
      "id": "17",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_certificatetransparencyenforcementdisabledforlegacycas",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_certificatetransparencyenforcementdisabledforlegacycas_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('17')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('17')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('18')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('18')",
      "id": "18",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_certificatetransparencyenforcementdisabledforcas",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_certificatetransparencyenforcementdisabledforcas_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('18')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('18')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('19')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('19')",
      "id": "19",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_disablesafebrowsingproceedanyway",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_disablesafebrowsingproceedanyway_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('19')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('19')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('20')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('20')",
      "id": "20",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_disablescreenshots",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_disablescreenshots_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('20')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('20')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('21')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('21')",
      "id": "21",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_autofilladdressenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_autofilladdressenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('21')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('21')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('22')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('22')",
      "id": "22",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_autofillcreditcardenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_autofillcreditcardenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('22')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('22')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('23')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('23')",
      "id": "23",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_componentupdatesenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_componentupdatesenabled_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('23')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('23')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('24')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('24')",
      "id": "24",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_allowdeletingbrowserhistory",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_allowdeletingbrowserhistory_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('24')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('24')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('25')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('25')",
      "id": "25",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_desktopsharinghubenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_desktopsharinghubenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('25')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('25')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('26')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('26')",
      "id": "26",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_renderercodeintegrityenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_renderercodeintegrityenabled_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('26')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('26')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('27')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('27')",
      "id": "27",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_promotionaltabsenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_promotionaltabsenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('27')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('27')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('28')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('28')",
      "id": "28",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_clicktocallenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_clicktocallenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('28')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('28')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('29')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('29')",
      "id": "29",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sharedclipboardenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sharedclipboardenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('29')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('29')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('30')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('30')",
      "id": "30",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_thirdpartyblockingenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_thirdpartyblockingenabled_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('30')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('30')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('31')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('31')",
      "id": "31",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_insecureformswarningsenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_insecureformswarningsenabled_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('31')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('31')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('32')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('32')",
      "id": "32",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_enableexperimentalpolicies",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_enableexperimentalpolicies_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('32')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('32')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('33')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('33')",
      "id": "33",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_blockexternalextensions",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_blockexternalextensions_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('33')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('33')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('34')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('34')",
      "id": "34",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forcegooglesafesearch",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forcegooglesafesearch_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('34')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('34')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('35')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('35')",
      "id": "35",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~googlecast_enablemediarouter",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~googlecast_enablemediarouter_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('35')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('35')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('36')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('36')",
      "id": "36",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_hidewebstoreicon",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_hidewebstoreicon_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('36')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('36')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('37')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('37')",
      "id": "37",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_allowcrossoriginauthprompt",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_allowcrossoriginauthprompt_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('37')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('37')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('38')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('38')",
      "id": "38",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_authschemes",
              "settingInstanceTemplateReference": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ntlm,negotiate"
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('38')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('38')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('39')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('39')",
      "id": "39",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importautofillformdata",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importautofillformdata_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('39')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('39')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('40')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('40')",
      "id": "40",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importhistory",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importhistory_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('40')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('40')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('41')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('41')",
      "id": "41",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importhomepage",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importhomepage_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('41')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('41')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('42')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('42')",
      "id": "42",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importsavedpasswords",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importsavedpasswords_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('42')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('42')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('43')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('43')",
      "id": "43",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importsearchengine",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_importsearchengine_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('43')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('43')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('44')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('44')",
      "id": "44",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin_tls1.2",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('44')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('44')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('45')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('45')",
      "id": "45",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~nativemessaging_nativemessaginguserlevelhosts",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~nativemessaging_nativemessaginguserlevelhosts_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('45')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('45')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('46')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('46')",
      "id": "46",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification_2",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('46')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('46')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('47')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('47')",
      "id": "47",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~passwordmanager_passwordmanagerenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~passwordmanager_passwordmanagerenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('47')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('47')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('48')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('48')",
      "id": "48",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowremoteaccessconnections",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowremoteaccessconnections_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('48')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('48')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('49')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('49')",
      "id": "49",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowfiletransfer",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowfiletransfer_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('49')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('49')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('50')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('50')",
      "id": "50",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowremotesupportconnections",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~remoteaccess_remoteaccesshostallowremotesupportconnections_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('50')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('50')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('51')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('51')",
      "id": "51",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_safebrowsingprotectionlevel",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_safebrowsingprotectionlevel_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_safebrowsingprotectionlevel_safebrowsingprotectionlevel",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_safebrowsingprotectionlevel_safebrowsingprotectionlevel_1",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('51')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('51')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('52')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('52')",
      "id": "52",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_defaultbrowsersettingenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_defaultbrowsersettingenabled_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('52')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('52')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('53')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('53')",
      "id": "53",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_showappsshortcutinbookmarkbar",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_showappsshortcutinbookmarkbar_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('53')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('53')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('54')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('54')",
      "id": "54",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_lookalikewarningallowlistdomains",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_lookalikewarningallowlistdomains_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('54')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('54')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('55')",
      "@odata.editLink": "deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('55')",
      "id": "55",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_suppressunsupportedoswarning",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_suppressunsupportedoswarning_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('55')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/settings('55')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('8908e8f7-4ad6-461d-820e-bccd8dae40b9')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
