{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsAutopilotDeploymentProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "@odata.id":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)",
    "@odata.editLink":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "id":  "48f6937a-d98a-4c06-a155-791380a9f4c1",
    "displayName":  "Windows Autopilot",
    "description":  "",
    "language":  "",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2022-09-05T20:03:32.907783Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-05T20:03:32.907783Z",
    "enrollmentStatusScreenSettings":  null,
    "extractHardwareHash":  true,
    "deviceNameTemplate":  "%SERIAL%",
    "deviceType@odata.type":  "#microsoft.graph.windowsAutopilotDeviceType",
    "deviceType":  "windowsPc",
    "enableWhiteGlove":  false,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "managementServiceAppId":  null,
    "outOfBoxExperienceSettings":  {
                                       "@odata.type":  "#microsoft.graph.outOfBoxExperienceSettings",
                                       "hidePrivacySettings":  true,
                                       "hideEULA":  true,
                                       "userType@odata.type":  "#microsoft.graph.windowsUserType",
                                       "userType":  "standard",
                                       "deviceUsageType@odata.type":  "#microsoft.graph.windowsDeviceUsageType",
                                       "deviceUsageType":  "singleUser",
                                       "skipKeyboardSelectionPage":  false,
                                       "hideEscapeLink":  true
                                   },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.windowsAutopilotDeploymentProfileAssignment",
                            "@odata.id":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/assignments(\u002748f6937a-d98a-4c06-a155-791380a9f4c1_b17b4b73-beb7-4a46-8e86-7c60711d144e_0\u0027)",
                            "@odata.editLink":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/assignments(\u002748f6937a-d98a-4c06-a155-791380a9f4c1_b17b4b73-beb7-4a46-8e86-7c60711d144e_0\u0027)",
                            "id":  "48f6937a-d98a-4c06-a155-791380a9f4c1_b17b4b73-beb7-4a46-8e86-7c60711d144e_0",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  "48f6937a-d98a-4c06-a155-791380a9f4c1",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "b17b4b73-beb7-4a46-8e86-7c60711d144e"
                                       }
                        }
                    ],
    "assignedDevices@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignedDevices/$ref",
    "assignedDevices@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignedDevices",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u002748f6937a-d98a-4c06-a155-791380a9f4c1\u0027)/microsoft.graph.windowsAutopilotDeploymentProfile/microsoft.graph.assign"
                                }
}
