{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementIntent",
    "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)",
    "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)",
    "id":  "e64cca1f-e339-4529-b1f8-6dd2d386d590",
    "displayName":  "Win - Baseline - Encryption - Device - BitLocker (Hyper-V Hosts)",
    "description":  null,
    "isAssigned":  false,
    "isMigratingToConfigurationPolicy":  null,
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2023-05-03T04:50:17.3328723Z",
    "templateId":  "d1174162-1dd2-4976-affc-6667049ab0ae",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/assignments",
    "assignments":  [

                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "ebbedac7-9ab8-451c-829f-0cb124e4bc22",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
                         "valueJson":  "{\"encryptionMethod\":\"aesCbc256\",\"requireEncryptionForWriteAccess\":false,\"blockCrossOrganizationWriteAccess\":false}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273f70a584-ce80-45d3-ac1d-224dd8b0464a\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273f70a584-ce80-45d3-ac1d-224dd8b0464a\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "3f70a584-ce80-45d3-ac1d-224dd8b0464a",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
                         "valueJson":  "false",
                         "value":  false
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027aa10271c-c5c0-490b-93ea-470bdca92c7a\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027aa10271c-c5c0-490b-93ea-470bdca92c7a\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "aa10271c-c5c0-490b-93ea-470bdca92c7a",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273637e944-977f-452d-b9c5-6d06e7627c0a\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273637e944-977f-452d-b9c5-6d06e7627c0a\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "3637e944-977f-452d-b9c5-6d06e7627c0a",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
                         "valueJson":  "{\"startupAuthenticationRequired\":true,\"startupAuthenticationTpmUsage\":\"allowed\",\"startupAuthenticationTpmPinUsage\":null,\"startupAuthenticationTpmKeyUsage\":\"blocked\",\"startupAuthenticationTpmPinAndKeyUsage\":null,\"startupAuthenticationBlockWithoutTpmChip\":false,\"prebootRecoveryEnableMessageAndUrl\":false,\"prebootRecoveryMessage\":null,\"prebootRecoveryUrl\":null,\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"encryptionMethod\":\"xtsAes256\",\"minimumPinLength\":null}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273637e944-977f-452d-b9c5-6d06e7627c0a\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00273637e944-977f-452d-b9c5-6d06e7627c0a\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "a53b1051-7611-4cf1-9e73-6f8a82e1f7d2",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
                         "valueJson":  "{\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"xtsAes256\"}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00276f2cd5c3-64a1-4763-91d0-840bcc7e2996\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00276f2cd5c3-64a1-4763-91d0-840bcc7e2996\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "6f2cd5c3-64a1-4763-91d0-840bcc7e2996",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00276028b146-3170-4ee0-82ba-9066a9f4fd1b\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u00276028b146-3170-4ee0-82ba-9066a9f4fd1b\u0027)/microsoft.graph.deviceManagementStringSettingInstance",
                         "id":  "6028b146-3170-4ee0-82ba-9066a9f4fd1b",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
                         "valueJson":  "\"enabledForAzureAd\"",
                         "value":  "enabledForAzureAd"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u002768f1cc32-9e0c-4e9b-8896-ccbb42ffb137\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/settings(\u002768f1cc32-9e0c-4e9b-8896-ccbb42ffb137\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "68f1cc32-9e0c-4e9b-8896-ccbb42ffb137",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
                         "valueJson":  "true",
                         "value":  true
                     }
                 ],
    "categories@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/categories/$ref",
    "categories@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/categories",
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceSettingStateSummaries",
    "deviceStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceStates/$ref",
    "deviceStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceStates",
    "deviceStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceStateSummary/$ref",
    "deviceStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/deviceStateSummary",
    "userStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/userStates/$ref",
    "userStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/userStates",
    "userStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/userStateSummary/$ref",
    "userStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/userStateSummary",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.migrateToTemplate":  {
                                               "title":  "microsoft.graph.migrateToTemplate",
                                               "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.migrateToTemplate"
                                           },
    "#microsoft.graph.updateSettings":  {
                                            "title":  "microsoft.graph.updateSettings",
                                            "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.updateSettings"
                                        },
    "#microsoft.graph.compare(templateId)":  {
                                                 "title":  "microsoft.graph.compare",
                                                 "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.compare(templateId=@templateId)"
                                             },
    "#microsoft.graph.getCustomizedSettings":  {
                                                   "title":  "microsoft.graph.getCustomizedSettings",
                                                   "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\u0027)/microsoft.graph.getCustomizedSettings"
                                               }
}
