"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027b79c99fd-b504-44b6-aef3-0cf80ebcc416\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027b79c99fd-b504-44b6-aef3-0cf80ebcc416\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"b79c99fd-b504-44b6-aef3-0cf80ebcc416\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength\",\r\n        \"valueJson\":  \"6\",\r\n        \"value\":  6\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00273998d3e9-5a1d-4d58-9ba8-13d0ec6ce0a1\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00273998d3e9-5a1d-4d58-9ba8-13d0ec6ce0a1\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"3998d3e9-5a1d-4d58-9ba8-13d0ec6ce0a1\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027440e12be-4a1b-4303-851e-38701b8b6171\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027440e12be-4a1b-4303-851e-38701b8b6171\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"440e12be-4a1b-4303-851e-38701b8b6171\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027f1001688-9935-48f4-ab61-450dfa343306\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027f1001688-9935-48f4-ab61-450dfa343306\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"f1001688-9935-48f4-ab61-450dfa343306\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027e299a5e2-98bd-400e-a5a6-4e7f6e5d68f3\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027e299a5e2-98bd-400e-a5a6-4e7f6e5d68f3\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"e299a5e2-98bd-400e-a5a6-4e7f6e5d68f3\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027a75d3b20-df59-45a8-a13b-74851c92bc86\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027a75d3b20-df59-45a8-a13b-74851c92bc86\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"a75d3b20-df59-45a8-a13b-74851c92bc86\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00277a696d26-5a5a-4ee2-9d93-8272a69aa98e\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00277a696d26-5a5a-4ee2-9d93-8272a69aa98e\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"7a696d26-5a5a-4ee2-9d93-8272a69aa98e\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u002730066ee7-3d11-4df0-8a12-8db0f2edd153\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u002730066ee7-3d11-4df0-8a12-8db0f2edd153\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"30066ee7-3d11-4df0-8a12-8db0f2edd153\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u002775fbb9ef-b011-47f8-a3f6-92cdccd518b4\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u002775fbb9ef-b011-47f8-a3f6-92cdccd518b4\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"75fbb9ef-b011-47f8-a3f6-92cdccd518b4\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00278a31055b-a836-49f7-8328-a963925f563c\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00278a31055b-a836-49f7-8328-a963925f563c\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"8a31055b-a836-49f7-8328-a963925f563c\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027fc906edb-e4f2-40d8-8dff-be5dd4244acb\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027fc906edb-e4f2-40d8-8dff-be5dd4244acb\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"fc906edb-e4f2-40d8-8dff-be5dd4244acb\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027a92e8f5d-2bc5-48a5-8759-ca2adbb269ef\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027a92e8f5d-2bc5-48a5-8759-ca2adbb269ef\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"a92e8f5d-2bc5-48a5-8759-ca2adbb269ef\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027c5e63b43-74e2-4a7e-8241-e4fcafc2120e\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u0027c5e63b43-74e2-4a7e-8241-e4fcafc2120e\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"c5e63b43-74e2-4a7e-8241-e4fcafc2120e\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00274fabc7d9-c469-4e6c-8efc-ed18a2eb9793\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00274fabc7d9-c469-4e6c-8efc-ed18a2eb9793\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"4fabc7d9-c469-4e6c-8efc-ed18a2eb9793\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00276c506bac-8ff9-4eec-aacd-f352aef02ef5\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027bb845818-ecca-4c3a-af81-313d7815f6af\\u0027)/settings(\\u00276c506bac-8ff9-4eec-aacd-f352aef02ef5\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"6c506bac-8ff9-4eec-aacd-f352aef02ef5\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    }\r\n]\n}"
