"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002728790cf6-d71d-4018-8f70-0f9c04ca6a57\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002728790cf6-d71d-4018-8f70-0f9c04ca6a57\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"28790cf6-d71d-4018-8f70-0f9c04ca6a57\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027c7796fa9-28eb-403a-91bc-13dee65bd574\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027c7796fa9-28eb-403a-91bc-13dee65bd574\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"c7796fa9-28eb-403a-91bc-13dee65bd574\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027bc3dc4fc-029b-4fc4-9165-177f6bdf6698\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027bc3dc4fc-029b-4fc4-9165-177f6bdf6698\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"bc3dc4fc-029b-4fc4-9165-177f6bdf6698\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002727611169-609d-4ddd-99ca-1a3d092d9869\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002727611169-609d-4ddd-99ca-1a3d092d9869\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"27611169-609d-4ddd-99ca-1a3d092d9869\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00277e80264e-9c38-4cf4-aa88-61c1718a28c8\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00277e80264e-9c38-4cf4-aa88-61c1718a28c8\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"7e80264e-9c38-4cf4-aa88-61c1718a28c8\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00272edd76bd-4e53-47d9-8617-6cdbf5b0498c\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00272edd76bd-4e53-47d9-8617-6cdbf5b0498c\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"2edd76bd-4e53-47d9-8617-6cdbf5b0498c\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027cb9105f9-ad49-4e10-87f9-6e9792f26384\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027cb9105f9-ad49-4e10-87f9-6e9792f26384\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"cb9105f9-ad49-4e10-87f9-6e9792f26384\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002794f97dc7-bbcb-4e2e-9357-7e0b317edbbb\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002794f97dc7-bbcb-4e2e-9357-7e0b317edbbb\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"94f97dc7-bbcb-4e2e-9357-7e0b317edbbb\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027f0821a44-5059-4173-afc1-b2d96e113967\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027f0821a44-5059-4173-afc1-b2d96e113967\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"f0821a44-5059-4173-afc1-b2d96e113967\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength\",\r\n        \"valueJson\":  \"6\",\r\n        \"value\":  6\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00279a4180be-c282-4180-a5f2-b2d9f8c15b2e\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00279a4180be-c282-4180-a5f2-b2d9f8c15b2e\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"9a4180be-c282-4180-a5f2-b2d9f8c15b2e\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00270335811d-19f0-4d33-8f8f-d990e83e4bc6\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00270335811d-19f0-4d33-8f8f-d990e83e4bc6\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"0335811d-19f0-4d33-8f8f-d990e83e4bc6\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027968a9433-f2bf-4468-a71c-dd665029c70f\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027968a9433-f2bf-4468-a71c-dd665029c70f\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"968a9433-f2bf-4468-a71c-dd665029c70f\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027ab02320b-f8ae-4916-80b4-e157ac2adf8c\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u0027ab02320b-f8ae-4916-80b4-e157ac2adf8c\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"ab02320b-f8ae-4916-80b4-e157ac2adf8c\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00275c7ad6fe-9450-4f68-86cb-eef7e4326fbd\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u00275c7ad6fe-9450-4f68-86cb-eef7e4326fbd\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"5c7ad6fe-9450-4f68-86cb-eef7e4326fbd\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002796b21c7a-45ec-4ebf-a106-f400a1302855\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027ae02b80a-09f9-490d-a358-5bc447260338\\u0027)/settings(\\u002796b21c7a-45ec-4ebf-a106-f400a1302855\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"96b21c7a-45ec-4ebf-a106-f400a1302855\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    }\r\n]\n}"
