"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"ebbedac7-9ab8-451c-829f-0cb124e4bc22\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"encryptionMethod\\\":\\\"aesCbc256\\\",\\\"requireEncryptionForWriteAccess\\\":false,\\\"blockCrossOrganizationWriteAccess\\\":false}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027ebbedac7-9ab8-451c-829f-0cb124e4bc22\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273f70a584-ce80-45d3-ac1d-224dd8b0464a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273f70a584-ce80-45d3-ac1d-224dd8b0464a\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"3f70a584-ce80-45d3-ac1d-224dd8b0464a\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027aa10271c-c5c0-490b-93ea-470bdca92c7a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027aa10271c-c5c0-490b-93ea-470bdca92c7a\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"aa10271c-c5c0-490b-93ea-470bdca92c7a\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273637e944-977f-452d-b9c5-6d06e7627c0a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273637e944-977f-452d-b9c5-6d06e7627c0a\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"3637e944-977f-452d-b9c5-6d06e7627c0a\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"startupAuthenticationRequired\\\":true,\\\"startupAuthenticationTpmUsage\\\":\\\"allowed\\\",\\\"startupAuthenticationTpmPinUsage\\\":null,\\\"startupAuthenticationTpmKeyUsage\\\":\\\"blocked\\\",\\\"startupAuthenticationTpmPinAndKeyUsage\\\":null,\\\"startupAuthenticationBlockWithoutTpmChip\\\":false,\\\"prebootRecoveryEnableMessageAndUrl\\\":false,\\\"prebootRecoveryMessage\\\":null,\\\"prebootRecoveryUrl\\\":null,\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"allowed\\\",\\\"recoveryInformationToStore\\\":\\\"passwordAndKey\\\",\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"allowed\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":true},\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"minimumPinLength\\\":null}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273637e944-977f-452d-b9c5-6d06e7627c0a\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00273637e944-977f-452d-b9c5-6d06e7627c0a\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"allowed\\\",\\\"recoveryInformationToStore\\\":\\\"passwordAndKey\\\",\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"allowed\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":true},\\\"requireEncryptionForWriteAccess\\\":true,\\\"encryptionMethod\\\":\\\"xtsAes256\\\"}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u0027a53b1051-7611-4cf1-9e73-6f8a82e1f7d2\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00276f2cd5c3-64a1-4763-91d0-840bcc7e2996\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00276f2cd5c3-64a1-4763-91d0-840bcc7e2996\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"6f2cd5c3-64a1-4763-91d0-840bcc7e2996\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00276028b146-3170-4ee0-82ba-9066a9f4fd1b\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u00276028b146-3170-4ee0-82ba-9066a9f4fd1b\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"6028b146-3170-4ee0-82ba-9066a9f4fd1b\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation\",\r\n        \"valueJson\":  \"\\\"enabledForAzureAd\\\"\",\r\n        \"value\":  \"enabledForAzureAd\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u002768f1cc32-9e0c-4e9b-8896-ccbb42ffb137\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027e64cca1f-e339-4529-b1f8-6dd2d386d590\\u0027)/settings(\\u002768f1cc32-9e0c-4e9b-8896-ccbb42ffb137\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"68f1cc32-9e0c-4e9b-8896-ccbb42ffb137\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    }\r\n]\n}"
