"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00277d9b3904-ceed-431d-b92a-03693751afc0\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00277d9b3904-ceed-431d-b92a-03693751afc0\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"7d9b3904-ceed-431d-b92a-03693751afc0\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002769f30061-97a5-4f3b-8d67-341b2095199e\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002769f30061-97a5-4f3b-8d67-341b2095199e\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"69f30061-97a5-4f3b-8d67-341b2095199e\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027af8c4c78-fb22-4653-aa85-466e62147ebb\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027af8c4c78-fb22-4653-aa85-466e62147ebb\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"af8c4c78-fb22-4653-aa85-466e62147ebb\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002753251966-5b78-4631-afef-77c36afd27db\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002753251966-5b78-4631-afef-77c36afd27db\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"53251966-5b78-4631-afef-77c36afd27db\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength\",\r\n        \"valueJson\":  \"6\",\r\n        \"value\":  6\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00272a9b75f6-93fc-4d92-86d8-91fa878524b5\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00272a9b75f6-93fc-4d92-86d8-91fa878524b5\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"2a9b75f6-93fc-4d92-86d8-91fa878524b5\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002732353740-7524-4591-9fbf-99c1b534d880\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002732353740-7524-4591-9fbf-99c1b534d880\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"32353740-7524-4591-9fbf-99c1b534d880\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027cc1ab389-0410-41f1-90b0-9fd5f8010d66\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027cc1ab389-0410-41f1-90b0-9fd5f8010d66\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"cc1ab389-0410-41f1-90b0-9fd5f8010d66\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002763b6dba4-3ff1-490d-ab11-a4ece3f2192f\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002763b6dba4-3ff1-490d-ab11-a4ece3f2192f\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"63b6dba4-3ff1-490d-ab11-a4ece3f2192f\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00270af37dcb-2408-4870-a133-a69209e2924e\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00270af37dcb-2408-4870-a133-a69209e2924e\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"0af37dcb-2408-4870-a133-a69209e2924e\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027039005e7-26a2-4dda-a44c-b01f4bbcc1bf\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027039005e7-26a2-4dda-a44c-b01f4bbcc1bf\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"039005e7-26a2-4dda-a44c-b01f4bbcc1bf\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002764a811c6-c299-4bb7-81e0-b1116ee32256\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u002764a811c6-c299-4bb7-81e0-b1116ee32256\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"64a811c6-c299-4bb7-81e0-b1116ee32256\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount\",\r\n        \"valueJson\":  \"0\",\r\n        \"value\":  0\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027eb78f03d-7740-46ad-bc77-b3e1715f5815\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027eb78f03d-7740-46ad-bc77-b3e1715f5815\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"eb78f03d-7740-46ad-bc77-b3e1715f5815\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027ce317851-cabc-4109-8220-d260a73dd193\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027ce317851-cabc-4109-8220-d260a73dd193\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"ce317851-cabc-4109-8220-d260a73dd193\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00270f737bd8-58a9-4fe7-8696-e839998b2be3\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u00270f737bd8-58a9-4fe7-8696-e839998b2be3\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"0f737bd8-58a9-4fe7-8696-e839998b2be3\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027814d2c18-95ec-4e7e-8202-ec9ec2dc41e0\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027cebbcad5-08ff-4a5a-9ed2-3a434234ddad\\u0027)/settings(\\u0027814d2c18-95ec-4e7e-8202-ec9ec2dc41e0\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"814d2c18-95ec-4e7e-8202-ec9ec2dc41e0\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    }\r\n]\n}"
