"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027f21ebdbf-6af3-4d7c-9c18-0d3b32d14061\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027f21ebdbf-6af3-4d7c-9c18-0d3b32d14061\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"f21ebdbf-6af3-4d7c-9c18-0d3b32d14061\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u002758879c01-11b0-4145-80a0-10f99e1bcab3\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u002758879c01-11b0-4145-80a0-10f99e1bcab3\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"58879c01-11b0-4145-80a0-10f99e1bcab3\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027ca48c0b4-bca7-4e9f-9fd6-1467e4defb4a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027ca48c0b4-bca7-4e9f-9fd6-1467e4defb4a\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"ca48c0b4-bca7-4e9f-9fd6-1467e4defb4a\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027cb01631a-88b4-42dc-b9c7-189e1187d043\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027cb01631a-88b4-42dc-b9c7-189e1187d043\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"cb01631a-88b4-42dc-b9c7-189e1187d043\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027cfface9c-3d51-4f1d-b245-269961470c39\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027cfface9c-3d51-4f1d-b245-269961470c39\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"cfface9c-3d51-4f1d-b245-269961470c39\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027727ccf82-da19-42b0-ad72-2d02b59de772\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027727ccf82-da19-42b0-ad72-2d02b59de772\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"727ccf82-da19-42b0-ad72-2d02b59de772\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027aa2520e0-f8f6-4ecd-a7ce-5bb56705a00a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027aa2520e0-f8f6-4ecd-a7ce-5bb56705a00a\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"aa2520e0-f8f6-4ecd-a7ce-5bb56705a00a\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u002750d45ea9-d33c-4afd-98e8-77c8b1d4d864\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u002750d45ea9-d33c-4afd-98e8-77c8b1d4d864\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"50d45ea9-d33c-4afd-98e8-77c8b1d4d864\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00278a25f146-34b5-452a-ac69-7a2430ef4309\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00278a25f146-34b5-452a-ac69-7a2430ef4309\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"8a25f146-34b5-452a-ac69-7a2430ef4309\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage\",\r\n        \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n        \"value\":  \"notConfigured\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027298496b0-52b3-480a-9968-af57b0fb6f17\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027298496b0-52b3-480a-9968-af57b0fb6f17\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"298496b0-52b3-480a-9968-af57b0fb6f17\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027c74474bf-d8df-44da-8ba8-c197589dcbe7\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027c74474bf-d8df-44da-8ba8-c197589dcbe7\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"c74474bf-d8df-44da-8ba8-c197589dcbe7\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00276076e445-84ae-4250-8198-e295907c1c1f\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00276076e445-84ae-4250-8198-e295907c1c1f\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"6076e445-84ae-4250-8198-e295907c1c1f\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027864dd23c-b921-4bba-aa64-e7bb8617d919\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027864dd23c-b921-4bba-aa64-e7bb8617d919\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"864dd23c-b921-4bba-aa64-e7bb8617d919\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027072bf618-0f27-405d-814d-e86f6e80fe22\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u0027072bf618-0f27-405d-814d-e86f6e80fe22\\u0027)/microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n        \"id\":  \"072bf618-0f27-405d-814d-e86f6e80fe22\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength\",\r\n        \"valueJson\":  \"null\",\r\n        \"value\":  null\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00273b37aa2b-9d64-4faa-8d0d-f5edc865aadb\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u0027d3ac1f0b-dec7-464a-a8a0-9dcd60e8b501\\u0027)/settings(\\u00273b37aa2b-9d64-4faa-8d0d-f5edc865aadb\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"3b37aa2b-9d64-4faa-8d0d-f5edc865aadb\",\r\n        \"definitionId\":  \"deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    }\r\n]\n}"
