"{ \"settings\": [\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002772d60ca2-960e-4099-823c-19f17ccc5e23\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002772d60ca2-960e-4099-823c-19f17ccc5e23\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"72d60ca2-960e-4099-823c-19f17ccc5e23\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b79280ac-79c8-4310-abb7-1eb7e86b7740\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b79280ac-79c8-4310-abb7-1eb7e86b7740\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"b79280ac-79c8-4310-abb7-1eb7e86b7740\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"requireEncryptionForWriteAccess\\\":false,\\\"blockCrossOrganizationWriteAccess\\\":false}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b79280ac-79c8-4310-abb7-1eb7e86b7740\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b79280ac-79c8-4310-abb7-1eb7e86b7740\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002711428950-7b63-422d-a316-209546d1a7ef\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002711428950-7b63-422d-a316-209546d1a7ef\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"11428950-7b63-422d-a316-209546d1a7ef\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"startupAuthenticationRequired\\\":true,\\\"startupAuthenticationTpmUsage\\\":\\\"required\\\",\\\"startupAuthenticationTpmPinUsage\\\":null,\\\"startupAuthenticationTpmKeyUsage\\\":\\\"blocked\\\",\\\"startupAuthenticationTpmPinAndKeyUsage\\\":null,\\\"startupAuthenticationBlockWithoutTpmChip\\\":false,\\\"prebootRecoveryEnableMessageAndUrl\\\":false,\\\"prebootRecoveryMessage\\\":null,\\\"prebootRecoveryUrl\\\":null,\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"allowed\\\",\\\"recoveryInformationToStore\\\":\\\"passwordAndKey\\\",\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"allowed\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":true},\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"minimumPinLength\\\":null}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002711428950-7b63-422d-a316-209546d1a7ef\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u002711428950-7b63-422d-a316-209546d1a7ef\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00276a3f25bb-ae43-4694-9a6a-3f2ba3405db4\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00276a3f25bb-ae43-4694-9a6a-3f2ba3405db4\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"6a3f25bb-ae43-4694-9a6a-3f2ba3405db4\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile\",\r\n        \"valueJson\":  \"false\",\r\n        \"value\":  false\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b3233237-6735-435e-b6e9-5cd5fe3afe40\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b3233237-6735-435e-b6e9-5cd5fe3afe40\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n        \"id\":  \"b3233237-6735-435e-b6e9-5cd5fe3afe40\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy\",\r\n        \"valueJson\":  \"{\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"allowed\\\",\\\"recoveryInformationToStore\\\":\\\"passwordAndKey\\\",\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"allowed\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":true},\\\"requireEncryptionForWriteAccess\\\":true,\\\"encryptionMethod\\\":\\\"xtsAes256\\\"}\",\r\n        \"value@odata.associationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b3233237-6735-435e-b6e9-5cd5fe3afe40\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n        \"value@odata.navigationLink\":  \"https://graph.microsoft.com/beta/deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b3233237-6735-435e-b6e9-5cd5fe3afe40\\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00277cfd8594-c2fb-49cd-a24f-c23e710acd03\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00277cfd8594-c2fb-49cd-a24f-c23e710acd03\\u0027)/microsoft.graph.deviceManagementStringSettingInstance\",\r\n        \"id\":  \"7cfd8594-c2fb-49cd-a24f-c23e710acd03\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation\",\r\n        \"valueJson\":  \"\\\"enabledForAzureAd\\\"\",\r\n        \"value\":  \"enabledForAzureAd\"\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00279818f5c4-0e5d-4117-83af-e198b416b47a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u00279818f5c4-0e5d-4117-83af-e198b416b47a\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"9818f5c4-0e5d-4117-83af-e198b416b47a\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    },\r\n    {\r\n        \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"@odata.id\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b1cf66a1-362f-4015-b0b7-fa9dd0a9878a\\u0027)\",\r\n        \"@odata.editLink\":  \"deviceManagement/intents(\\u00275df6e162-8634-467a-ab2d-4e0155c1cbd1\\u0027)/settings(\\u0027b1cf66a1-362f-4015-b0b7-fa9dd0a9878a\\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n        \"id\":  \"b1cf66a1-362f-4015-b0b7-fa9dd0a9878a\",\r\n        \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption\",\r\n        \"valueJson\":  \"true\",\r\n        \"value\":  true\r\n    }\r\n]\n}"
