{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/assignmentFilters/$entity",
    "@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilter",
    "@odata.id":  "deviceManagement/assignmentFilters(\u002745df6ef4-6bac-4d71-986e-e20817a71886\u0027)",
    "@odata.editLink":  "deviceManagement/assignmentFilters(\u002745df6ef4-6bac-4d71-986e-e20817a71886\u0027)",
    "id":  "45df6ef4-6bac-4d71-986e-e20817a71886",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2022-09-05T20:02:54.4362872Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-05T20:02:54.4362872Z",
    "displayName":  "Windows 11 Devices",
    "description":  "",
    "platform@odata.type":  "#microsoft.graph.devicePlatformType",
    "platform":  "windows10AndLater",
    "rule":  "(device.deviceOwnership -eq \"Corporate\") and (device.osVersion -startsWith \"10.0.2\")",
    "roleScopeTags@odata.type":  "#Collection(String)",
    "roleScopeTags":  [
                          "0"
                      ],
    "#microsoft.graph.getSupportedProperties":  {
                                                    "title":  "microsoft.graph.getSupportedProperties",
                                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/assignmentFilters(\u002745df6ef4-6bac-4d71-986e-e20817a71886\u0027)/microsoft.graph.getSupportedProperties"
                                                }
}
