{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id":  "6c0baa2a-2f9e-460b-8f7a-c0cd30ba6476",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2023-10-27T15:13:32.4738734Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-10-27T15:13:32.4738734Z",
    "description":  "Devices in this ring are moved to the Beta Insider Channel and receive updates immediately after release with 1 day grace period before a forced reboot.",
    "displayName":  "Win - OIB - WUfB - Insiders - Beta Channel - v3.0",
    "version":  1,
    "deliveryOptimizationMode@odata.type":  "#microsoft.graph.windowsDeliveryOptimizationMode",
    "deliveryOptimizationMode":  "userDefined",
    "prereleaseFeatures@odata.type":  "#microsoft.graph.prereleaseFeatures",
    "prereleaseFeatures":  "userDefined",
    "automaticUpdateMode@odata.type":  "#microsoft.graph.automaticUpdateMode",
    "automaticUpdateMode":  "windowsDefault",
    "microsoftUpdateServiceAllowed":  true,
    "driversExcluded":  false,
    "installationSchedule":  null,
    "qualityUpdatesDeferralPeriodInDays":  0,
    "featureUpdatesDeferralPeriodInDays":  0,
    "qualityUpdatesPaused":  false,
    "featureUpdatesPaused":  false,
    "qualityUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly@odata.type":  "#microsoft.graph.windowsUpdateType",
    "businessReadyUpdatesOnly":  "windowsInsiderBuildSlow",
    "skipChecksBeforeRestart":  false,
    "updateWeeks":  null,
    "qualityUpdatesPauseStartDate":  null,
    "featureUpdatesPauseStartDate":  null,
    "featureUpdatesRollbackWindowInDays":  14,
    "qualityUpdatesWillBeRolledBack":  false,
    "featureUpdatesWillBeRolledBack":  false,
    "qualityUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "qualityUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime@odata.type":  "#DateTimeOffset",
    "featureUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays":  null,
    "engagedRestartSnoozeScheduleInDays":  null,
    "engagedRestartTransitionScheduleInDays":  null,
    "deadlineForFeatureUpdatesInDays":  0,
    "deadlineForQualityUpdatesInDays":  0,
    "deadlineGracePeriodInDays":  1,
    "postponeRebootUntilAfterDeadline":  true,
    "autoRestartNotificationDismissal@odata.type":  "#microsoft.graph.autoRestartNotificationDismissalMethod",
    "autoRestartNotificationDismissal":  "notConfigured",
    "scheduleRestartWarningInHours":  null,
    "scheduleImminentRestartWarningInMinutes":  null,
    "userPauseAccess@odata.type":  "#microsoft.graph.enablement",
    "userPauseAccess":  "disabled",
    "userWindowsUpdateScanAccess@odata.type":  "#microsoft.graph.enablement",
    "userWindowsUpdateScanAccess":  "enabled",
    "updateNotificationLevel@odata.type":  "#microsoft.graph.windowsUpdateNotificationDisplayOption",
    "updateNotificationLevel":  "defaultNotifications",
    "allowWindows11Upgrade":  false,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.extendFeatureUpdatesPause":  {
                                                       "title":  "microsoft.graph.extendFeatureUpdatesPause",
                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendFeatureUpdatesPause"
                                                   },
    "#microsoft.graph.extendQualityUpdatesPause":  {
                                                       "title":  "microsoft.graph.extendQualityUpdatesPause",
                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendQualityUpdatesPause"
                                                   },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276c0baa2a-2f9e-460b-8f7a-c0cd30ba6476\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
