{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsFeatureUpdateProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsFeatureUpdateProfile",
    "@odata.id":  "deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)",
    "@odata.editLink":  "deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)",
    "id":  "e5b622a3-0821-4a36-8952-82d92bce8098",
    "displayName":  "Windows 11 21H2",
    "description":  "",
    "featureUpdateVersion":  "Windows 11, version 21H2",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2022-09-05T20:02:59.8004421Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-20T00:12:49Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deployableContentDisplayName":  "Windows 11",
    "endOfSupportDate@odata.type":  "#DateTimeOffset",
    "endOfSupportDate":  "2024-10-08T00:00:00Z",
    "rolloutSettings":  {
                            "@odata.type":  "#microsoft.graph.windowsUpdateRolloutSettings",
                            "offerStartDateTimeInUTC":  null,
                            "offerEndDateTimeInUTC":  null,
                            "offerIntervalInDays":  null
                        },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.windowsFeatureUpdateProfileAssignment",
                            "@odata.id":  "deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/assignments(\u0027e5b622a3-0821-4a36-8952-82d92bce8098_53d5f1d3-8847-4f9f-8fac-1602bada5e45\u0027)",
                            "@odata.editLink":  "deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/assignments(\u0027e5b622a3-0821-4a36-8952-82d92bce8098_53d5f1d3-8847-4f9f-8fac-1602bada5e45\u0027)",
                            "id":  "e5b622a3-0821-4a36-8952-82d92bce8098_53d5f1d3-8847-4f9f-8fac-1602bada5e45",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "53d5f1d3-8847-4f9f-8fac-1602bada5e45"
                                       }
                        }
                    ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u0027e5b622a3-0821-4a36-8952-82d92bce8098\u0027)/microsoft.graph.assign"
                                }
}
