{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementIntent",
    "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)",
    "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)",
    "id":  "dbbce64a-28ca-455b-871d-284964550f5c",
    "displayName":  "Baseline - Win - BitLocker Encryption",
    "description":  null,
    "isAssigned":  true,
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-20T17:06:07.3861606Z",
    "templateId":  "d1174162-1dd2-4976-affc-6667049ab0ae",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementIntentAssignment",
                            "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments(\u0027bbef6b08-9ca8-40dd-b01c-7522b9ec7021\u0027)",
                            "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments(\u0027bbef6b08-9ca8-40dd-b01c-7522b9ec7021\u0027)",
                            "id":  "bbef6b08-9ca8-40dd-b01c-7522b9ec7021",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.allDevicesAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none"
                                       }
                        },
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementIntentAssignment",
                            "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments(\u0027885610f5-057e-47bf-afac-dc1300a4bbcd\u0027)",
                            "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/assignments(\u0027885610f5-057e-47bf-afac-dc1300a4bbcd\u0027)",
                            "id":  "885610f5-057e-47bf-afac-dc1300a4bbcd",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.exclusionGroupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "62adb3f8-196c-47fb-b48a-e2652f003ce6"
                                       }
                        }
                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00271a1a3d38-a0bc-40a0-aa03-008aa0583f6c\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00271a1a3d38-a0bc-40a0-aa03-008aa0583f6c\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "1a1a3d38-a0bc-40a0-aa03-008aa0583f6c",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
                         "valueJson":  "false",
                         "value":  false
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027c91cf113-a4c9-4cd9-8c2a-1ccc02aae8a5\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027c91cf113-a4c9-4cd9-8c2a-1ccc02aae8a5\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "c91cf113-a4c9-4cd9-8c2a-1ccc02aae8a5",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027014731fb-eb56-4b3d-ba7e-368035fd5568\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027014731fb-eb56-4b3d-ba7e-368035fd5568\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "014731fb-eb56-4b3d-ba7e-368035fd5568",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
                         "valueJson":  "{\"startupAuthenticationRequired\":true,\"startupAuthenticationTpmUsage\":\"required\",\"startupAuthenticationTpmPinUsage\":null,\"startupAuthenticationTpmKeyUsage\":\"blocked\",\"startupAuthenticationTpmPinAndKeyUsage\":null,\"startupAuthenticationBlockWithoutTpmChip\":false,\"prebootRecoveryEnableMessageAndUrl\":false,\"prebootRecoveryMessage\":null,\"prebootRecoveryUrl\":null,\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"encryptionMethod\":\"xtsAes256\",\"minimumPinLength\":null}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027014731fb-eb56-4b3d-ba7e-368035fd5568\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027014731fb-eb56-4b3d-ba7e-368035fd5568\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00274113f932-6c49-4368-bb72-402de482689c\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00274113f932-6c49-4368-bb72-402de482689c\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "4113f932-6c49-4368-bb72-402de482689c",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b1ca9e24-4810-42f3-8a13-5a307b9943b5\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b1ca9e24-4810-42f3-8a13-5a307b9943b5\u0027)/microsoft.graph.deviceManagementStringSettingInstance",
                         "id":  "b1ca9e24-4810-42f3-8a13-5a307b9943b5",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
                         "valueJson":  "\"enabledForAzureAd\"",
                         "value":  "enabledForAzureAd"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027848b33f5-5b4b-41f7-ab08-62937e8d75d5\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027848b33f5-5b4b-41f7-ab08-62937e8d75d5\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "848b33f5-5b4b-41f7-ab08-62937e8d75d5",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
                         "valueJson":  "{\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"xtsAes256\"}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027848b33f5-5b4b-41f7-ab08-62937e8d75d5\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027848b33f5-5b4b-41f7-ab08-62937e8d75d5\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00278e7b0e4c-9f2a-43ff-8ac7-c03e98f5f357\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u00278e7b0e4c-9f2a-43ff-8ac7-c03e98f5f357\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "8e7b0e4c-9f2a-43ff-8ac7-c03e98f5f357",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b4f1327a-e3d4-4153-88af-f70f9a0cb379\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b4f1327a-e3d4-4153-88af-f70f9a0cb379\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "b4f1327a-e3d4-4153-88af-f70f9a0cb379",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
                         "valueJson":  "{\"encryptionMethod\":\"xtsAes256\",\"requireEncryptionForWriteAccess\":false,\"blockCrossOrganizationWriteAccess\":false}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b4f1327a-e3d4-4153-88af-f70f9a0cb379\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/settings(\u0027b4f1327a-e3d4-4153-88af-f70f9a0cb379\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     }
                 ],
    "categories@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/categories/$ref",
    "categories@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/categories",
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceSettingStateSummaries",
    "deviceStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceStates/$ref",
    "deviceStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceStates",
    "deviceStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceStateSummary/$ref",
    "deviceStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/deviceStateSummary",
    "userStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/userStates/$ref",
    "userStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/userStates",
    "userStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/userStateSummary/$ref",
    "userStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/userStateSummary",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.migrateToTemplate":  {
                                               "title":  "microsoft.graph.migrateToTemplate",
                                               "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/microsoft.graph.migrateToTemplate"
                                           },
    "#microsoft.graph.updateSettings":  {
                                            "title":  "microsoft.graph.updateSettings",
                                            "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/microsoft.graph.updateSettings"
                                        },
    "#microsoft.graph.compare(templateId)":  {
                                                 "title":  "microsoft.graph.compare",
                                                 "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027dbbce64a-28ca-455b-871d-284964550f5c\u0027)/microsoft.graph.compare(templateId=@templateId)"
                                             }
}
