{ "settings": [
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002760ae03ea-334c-4c0a-9a4a-03ed8a9a1c2e\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002760ae03ea-334c-4c0a-9a4a-03ed8a9a1c2e\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "60ae03ea-334c-4c0a-9a4a-03ed8a9a1c2e",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_usbBlocked",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273b000744-4612-43de-8230-0ca01438fe4d\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273b000744-4612-43de-8230-0ca01438fe4d\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "3b000744-4612-43de-8230-0ca01438fe4d",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_preventHardwareDeviceInstallationByDeviceInstanceIdentifiers",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273b000744-4612-43de-8230-0ca01438fe4d\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273b000744-4612-43de-8230-0ca01438fe4d\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273fbe276e-3691-4b39-8694-1781500c1ef7\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273fbe276e-3691-4b39-8694-1781500c1ef7\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "3fbe276e-3691-4b39-8694-1781500c1ef7",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockAdvertising",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027960ccd2a-1a5e-4cda-929d-2637c60e9f07\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027960ccd2a-1a5e-4cda-929d-2637c60e9f07\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "960ccd2a-1a5e-4cda-929d-2637c60e9f07",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a4534fb5-026c-45d2-8259-2d868822416a\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a4534fb5-026c-45d2-8259-2d868822416a\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "a4534fb5-026c-45d2-8259-2d868822416a",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationByDeviceInstanceIdentifiers",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a4534fb5-026c-45d2-8259-2d868822416a\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a4534fb5-026c-45d2-8259-2d868822416a\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002758b4d152-1c5f-4dc9-9d09-399d7150db5c\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002758b4d152-1c5f-4dc9-9d09-399d7150db5c\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "58b4d152-1c5f-4dc9-9d09-399d7150db5c",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockPromptedProximalConnections",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b4f1fe1f-f9fb-4e42-ba02-39b61186b557\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b4f1fe1f-f9fb-4e42-ba02-39b61186b557\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "b4f1fe1f-f9fb-4e42-ba02-39b61186b557",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b4f1fe1f-f9fb-4e42-ba02-39b61186b557\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b4f1fe1f-f9fb-4e42-ba02-39b61186b557\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002764efb9f9-1025-46ef-9757-42f23c58e900\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002764efb9f9-1025-46ef-9757-42f23c58e900\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "64efb9f9-1025-46ef-9757-42f23c58e900",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationByDeviceIdentifiers",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002764efb9f9-1025-46ef-9757-42f23c58e900\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002764efb9f9-1025-46ef-9757-42f23c58e900\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a718fc33-3926-4251-b08b-52b43927f7fb\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a718fc33-3926-4251-b08b-52b43927f7fb\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "a718fc33-3926-4251-b08b-52b43927f7fb",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationByDeviceIdentifiers",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a718fc33-3926-4251-b08b-52b43927f7fb\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027a718fc33-3926-4251-b08b-52b43927f7fb\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027505f21a9-254a-4b55-8f5d-7a6fd2a10898\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027505f21a9-254a-4b55-8f5d-7a6fd2a10898\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "505f21a9-254a-4b55-8f5d-7a6fd2a10898",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_storageBlockRemovableStorage",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027e0fdb2a6-3730-4ce1-8fd1-a0043ede086d\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027e0fdb2a6-3730-4ce1-8fd1-a0043ede086d\u0027)/microsoft.graph.deviceManagementStringSettingInstance",
        "id":  "e0fdb2a6-3730-4ce1-8fd1-a0043ede086d",
        "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b8fe06ff-c769-4b90-9b04-a6bcc0c83654\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b8fe06ff-c769-4b90-9b04-a6bcc0c83654\u0027)/microsoft.graph.deviceManagementCollectionSettingInstance",
        "id":  "b8fe06ff-c769-4b90-9b04-a6bcc0c83654",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothAllowedServices",
        "valueJson":  "null",
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b8fe06ff-c769-4b90-9b04-a6bcc0c83654\u0027)/microsoft.graph.deviceManagementCollectionSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027b8fe06ff-c769-4b90-9b04-a6bcc0c83654\u0027)/microsoft.graph.deviceManagementCollectionSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027c0763f5f-2f67-4bfb-acf2-b301f2a74eba\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027c0763f5f-2f67-4bfb-acf2-b301f2a74eba\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "c0763f5f-2f67-4bfb-acf2-b301f2a74eba",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlocked",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002780638afb-a6ac-4e1e-be85-b899ad4f8c0e\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u002780638afb-a6ac-4e1e-be85-b899ad4f8c0e\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "80638afb-a6ac-4e1e-be85-b899ad4f8c0e",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockPrePairing",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027462ef389-5351-4c36-8a97-c2d019d92bd0\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u0027462ef389-5351-4c36-8a97-c2d019d92bd0\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "462ef389-5351-4c36-8a97-c2d019d92bd0",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess",
        "valueJson":  "true",
        "value":  true
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00276bcabe3c-5c26-4a66-8eb7-dbc9fa3e591b\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00276bcabe3c-5c26-4a66-8eb7-dbc9fa3e591b\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "6bcabe3c-5c26-4a66-8eb7-dbc9fa3e591b",
        "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_storageBlockRemovableStorageWrite",
        "valueJson":  "null",
        "value":  null
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00270b3e4b26-f902-4f08-bb80-e17b7f1ed44c\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00270b3e4b26-f902-4f08-bb80-e17b7f1ed44c\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "id":  "0b3e4b26-f902-4f08-bb80-e17b7f1ed44c",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationBySetupClasses",
        "valueJson":  "null",
        "implementationId":  null,
        "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00270b3e4b26-f902-4f08-bb80-e17b7f1ed44c\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value/$ref",
        "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00270b3e4b26-f902-4f08-bb80-e17b7f1ed44c\u0027)/microsoft.graph.deviceManagementAbstractComplexSettingInstance/value"
    },
    {
        "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "@odata.id":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273a7a4656-3240-44a8-a74f-fd1dbd8fded3\u0027)",
        "@odata.editLink":  "deviceManagement/intents(\u0027225b0891-6339-4bd4-8877-138674b287d6\u0027)/settings(\u00273a7a4656-3240-44a8-a74f-fd1dbd8fded3\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
        "id":  "3a7a4656-3240-44a8-a74f-fd1dbd8fded3",
        "definitionId":  "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockDiscoverableMode",
        "valueJson":  "null",
        "value":  null
    }
]
}
