{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementIntent",
    "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)",
    "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)",
    "id":  "e1f7c277-e6df-4930-b89a-39844146d838",
    "displayName":  "Baseline - Win - BitLocker Encryption (Hyper-V)",
    "description":  null,
    "isAssigned":  true,
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2022-09-20T17:06:15.6370209Z",
    "templateId":  "d1174162-1dd2-4976-affc-6667049ab0ae",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementIntentAssignment",
                            "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/assignments(\u002749fd0905-9b24-46f3-8f98-bd076df52ef7\u0027)",
                            "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/assignments(\u002749fd0905-9b24-46f3-8f98-bd076df52ef7\u0027)",
                            "id":  "49fd0905-9b24-46f3-8f98-bd076df52ef7",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "62adb3f8-196c-47fb-b48a-e2652f003ce6"
                                       }
                        }
                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00279f1f361b-bdd6-4c51-aaa1-4ccfe3d47d66\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00279f1f361b-bdd6-4c51-aaa1-4ccfe3d47d66\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "9f1f361b-bdd6-4c51-aaa1-4ccfe3d47d66",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
                         "valueJson":  "{\"encryptionMethod\":\"xtsAes256\",\"requireEncryptionForWriteAccess\":false,\"blockCrossOrganizationWriteAccess\":false}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00279f1f361b-bdd6-4c51-aaa1-4ccfe3d47d66\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00279f1f361b-bdd6-4c51-aaa1-4ccfe3d47d66\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027213c3c83-9678-41ac-b793-4f288832f435\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027213c3c83-9678-41ac-b793-4f288832f435\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "213c3c83-9678-41ac-b793-4f288832f435",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
                         "valueJson":  "{\"startupAuthenticationRequired\":true,\"startupAuthenticationTpmUsage\":\"allowed\",\"startupAuthenticationTpmPinUsage\":null,\"startupAuthenticationTpmKeyUsage\":\"blocked\",\"startupAuthenticationTpmPinAndKeyUsage\":null,\"startupAuthenticationBlockWithoutTpmChip\":false,\"prebootRecoveryEnableMessageAndUrl\":false,\"prebootRecoveryMessage\":null,\"prebootRecoveryUrl\":null,\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"encryptionMethod\":\"xtsAes256\",\"minimumPinLength\":null}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027213c3c83-9678-41ac-b793-4f288832f435\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027213c3c83-9678-41ac-b793-4f288832f435\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027cd53c391-e023-47da-b759-89b533257e8b\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027cd53c391-e023-47da-b759-89b533257e8b\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "cd53c391-e023-47da-b759-89b533257e8b",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00273abc16ed-e4e0-4bbf-9aa8-9ff0595d76e6\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u00273abc16ed-e4e0-4bbf-9aa8-9ff0595d76e6\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "3abc16ed-e4e0-4bbf-9aa8-9ff0595d76e6",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027ec0db4f4-bdff-45a0-8e82-c8920f546568\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027ec0db4f4-bdff-45a0-8e82-c8920f546568\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "ec0db4f4-bdff-45a0-8e82-c8920f546568",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
                         "valueJson":  "true",
                         "value":  true
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027f38edc55-5fa4-4a1b-8803-cf7dcedbff0a\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027f38edc55-5fa4-4a1b-8803-cf7dcedbff0a\u0027)/microsoft.graph.deviceManagementStringSettingInstance",
                         "id":  "f38edc55-5fa4-4a1b-8803-cf7dcedbff0a",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
                         "valueJson":  "\"enabledForAzureAd\"",
                         "value":  "enabledForAzureAd"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027f8ac28d9-4b16-4cac-8983-e43aa6b253bb\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027f8ac28d9-4b16-4cac-8983-e43aa6b253bb\u0027)/microsoft.graph.deviceManagementBooleanSettingInstance",
                         "id":  "f8ac28d9-4b16-4cac-8983-e43aa6b253bb",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
                         "valueJson":  "false",
                         "value":  false
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementComplexSettingInstance",
                         "@odata.id":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027bd1f7c43-04b5-422d-9146-e5a3457411de\u0027)",
                         "@odata.editLink":  "deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027bd1f7c43-04b5-422d-9146-e5a3457411de\u0027)/microsoft.graph.deviceManagementComplexSettingInstance",
                         "id":  "bd1f7c43-04b5-422d-9146-e5a3457411de",
                         "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
                         "valueJson":  "{\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":true},\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"xtsAes256\"}",
                         "value@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027bd1f7c43-04b5-422d-9146-e5a3457411de\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
                         "value@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/settings(\u0027bd1f7c43-04b5-422d-9146-e5a3457411de\u0027)/microsoft.graph.deviceManagementComplexSettingInstance/value"
                     }
                 ],
    "categories@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/categories/$ref",
    "categories@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/categories",
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceSettingStateSummaries",
    "deviceStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceStates/$ref",
    "deviceStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceStates",
    "deviceStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceStateSummary/$ref",
    "deviceStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/deviceStateSummary",
    "userStates@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/userStates/$ref",
    "userStates@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/userStates",
    "userStateSummary@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/userStateSummary/$ref",
    "userStateSummary@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/userStateSummary",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.migrateToTemplate":  {
                                               "title":  "microsoft.graph.migrateToTemplate",
                                               "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/microsoft.graph.migrateToTemplate"
                                           },
    "#microsoft.graph.updateSettings":  {
                                            "title":  "microsoft.graph.updateSettings",
                                            "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/microsoft.graph.updateSettings"
                                        },
    "#microsoft.graph.compare(templateId)":  {
                                                 "title":  "microsoft.graph.compare",
                                                 "target":  "https://graph.microsoft.com/beta/deviceManagement/intents(\u0027e1f7c277-e6df-4930-b89a-39844146d838\u0027)/microsoft.graph.compare(templateId=@templateId)"
                                             }
}
