{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsDriverUpdateProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsDriverUpdateProfile",
    "@odata.id":  "deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)",
    "@odata.editLink":  "deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)",
    "id":  "6942c9f2-704b-4cb2-96da-34f66f7aeaf5",
    "displayName":  "Win - OIB - WUfB Drivers - Ring 3 - Production - v3.0",
    "description":  "",
    "approvalType@odata.type":  "#microsoft.graph.driverUpdateProfileApprovalType",
    "approvalType":  "automatic",
    "deviceReporting":  0,
    "newUpdates":  0,
    "deploymentDeferralInDays":  10,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-08-30T16:33:12.1831561Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2023-08-30T16:49:34.6590519Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "inventorySyncStatus":  {
                                "@odata.type":  "#microsoft.graph.windowsDriverUpdateProfileInventorySyncStatus",
                                "lastSuccessfulSyncDateTime@odata.type":  "#DateTimeOffset",
                                "lastSuccessfulSyncDateTime":  "2023-10-26T08:26:49.1001996Z",
                                "driverInventorySyncState@odata.type":  "#microsoft.graph.windowsDriverUpdateProfileInventorySyncState",
                                "driverInventorySyncState":  "success"
                            },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/assignments",
    "driverInventories@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/driverInventories/$ref",
    "driverInventories@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/driverInventories",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.executeAction":  {
                                           "title":  "microsoft.graph.executeAction",
                                           "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/microsoft.graph.executeAction"
                                       },
    "#microsoft.graph.syncInventory":  {
                                           "title":  "microsoft.graph.syncInventory",
                                           "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u00276942c9f2-704b-4cb2-96da-34f66f7aeaf5\u0027)/microsoft.graph.syncInventory"
                                       }
}
